package handler

import "fmt"

func (h *Handler) buildBirthdayMessage(mask string) string {
	return fmt.Sprintf(`
📆 Укажи свою дату рождения%s%s

<i>*После регистрации дату рождения нельзя будет сменить самостоятельно. Выбирай с умом</i>`, birthDateSeparator, mask)
}

func (h *Handler) buildStartupMessage() string {
	return `
👋 Привееет! Я - <b>Gargantua Labs</b>. Твой многофункциональный помощник для решения административных задач (и не только..)

Давай пройдем небольшую регистрацию, для получения доступа ко всей платформе 👇
			`
}

func (h *Handler) buildRegisterMessage() string {
	return `
📄 Нажимая кнопку, ты даешь согласие на обработку переданных данных, для регистрации.

<i>*Мы собираем только нужные нам данные для работы некоторых функций и модулей платформы. Данные третьим лицам не передаются.</i>
		`
}

func (h *Handler) buildConnectBotMessage() string {
	return `
⚙️ Инструкция подключения бота:

1. Перейдите в @BotFather и создайте нового бота
2. Скопируйте токен созданного вами бота.
3. Нажмите на кнопку «Приступить» и пришлите токен в этот чат (только токен, ничего больше)
4. Как только токен бота авторизуется в нашей системе, вам придет сообщение от вашего бота, о готовности к работе (важно убедиться, что ваш бот может отправлять вам сообщения)
5. После получения сообщения о готовности, перейдите в вашего бота и настройте оплаченные модули под ваши задачи

*<i>@BotFather - официальный бот от Telegram, для создания собственных ботов</i>
*<i>Такой способ авторизации, позволяет нам обходить ограничения количества запросов на токен и масштабировать платформу, предоставляя качественный сервис</i>
		`
}

func (h *Handler) buildInvalidBotMessage() string {
	return `
🚫 Неудачная авторизация!

❓Возможные проблемы:

1. Токен устарел или недействителен
2. Токен от несуществующего бота
3. Не валидный по формату токен
4. Сетевые проблемы на стороне Telegram

Попробуйте повторить попытку позже или ознакомиться с инструкцией получения токена в @BotFather от Telegram
				`
}
